#include <stdio.h>

/*Задача 1. Напишете програма, която сумира всички елементи на масив
намиращи се на четна позиция:
int arr[10] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};
Декларирайте пойнтер към първата нечетна позиция, инкрементирайте
пойнтера по подходящ начин, за да извършите сумирането.*/

int sum(int *s);

int main(void){

    int arr[10] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};
    printf("Sum is: %d",sum(arr));

    return 0;
}

int sum(int *s){

    int i,sum=0,*p = &s[1];
    for(i=1;i<9;i++){
        if(i%2 != 0){  // Проверка за четна позиция. Започваме от 1-вия елемент, заради поинтъра и продължаваме до последния, като трябва да са нечетни, за да се сумират четните позиции.
            sum = sum + *(p+i);
        }
    }

    return sum + *(s+0);
}