#include <stdio.h>
#include <stdlib.h>

/*Задача 7. Напишете заглавен файл с декларации на функции и
сложете гардове. Този начин намалява времето за компилиране на
големи проекти.

Прочетете за директивата #pragma once. Отговорете
дали тази директива е еквивалентна на гарда в упражнение 4*/

// #pragma once е като гардовете и позволява на дадена директива да бъде добавяна и компилирана само веднъж по време на компилация.
// #pragma once има някои предимства пред гардовете, а именно: по-малко код, избягване на имеви сблъсъци и бързина при компилиране

#ifndef _MYHEADER_H_  
#define _MYHEADER_H_

int two(void);
void foo(void);

#endif // _MYHEADER_H_