#include <stdio.h>

/*Задача 7. Дефинирайте масив int с 10 елемента. Дефинирайте
пойнтер, който ще сочи към масива. Насочете пойнтера към масива. Нужно
ли е да използвате &? Какво представлява името на масива? Какво сочи?
Колко начина има за да изпишете насочването на пойнтера към масива.
Има ли разлика между тях?*/

int main(void){

    int arr[10] = {0,1,2,3,4,5,6,7,8,9};
    int *p = arr; // Не е нужно да използваме &, защото името на масива сочи към първият елемент, т.е нулевия

    int (*ptr)[10] = &arr; // ptr сочи към целия масив, което е различно от p, който сочи само към първият елемент

    printf("p = %p, ptr = %p\n", p, ptr); 
    printf("*p = %d, *ptr = %p\n", *p, *ptr);
    printf("sizeof(p) = %lu, sizeof(*p) = %lu\n",sizeof(p), sizeof(*p)); 
    printf("sizeof(ptr) = %lu, sizeof(*ptr) = %lu\n",sizeof(ptr), sizeof(*ptr)); 

    return 0;
}