#include <stdio.h>
#include <stdlib.h>

/*Задача 6.
Дефинирайте променлива „а“, дeфинирайте пойнтер към
нея, присвоете му адреса на променливата. През пойнтера
задайте нова стойност = 5 на променливата „а“. Каква е
стойността на “а”?*/

int main(void){

    int a;
    int *pi = &a;
    *pi = 5;
    printf("A: %d\n",a); // Стойността на a e 5

    return 0;
}